performance_test/POST-test.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Baseline test with 1 user per second"
  variables:
    productId:
      - "10000000"
      - "9000000"
      - "8000000"
      - "7000000"
      - "6000000"
      - "5000000"
      - "4000000"
      - "3000000"
      - "2000000"
      - "1000000"
    price:
      - "9.99"
      - "19.99"
      - "29.99"
      - "39.99"
      - "49.99"
      - "59.99"
      - "99.99"
    tax:
      - "0.5"
      - "1"
      - "1.5"
      - "2"
      - "2.5"
      - "3"
      - "5"
    seller:
      - "Normal John"
      - "Sherman"
      - "Brendon"
      - "Chandler"
      - "Elwin"
      - "Buddy"
scenarios:
  - name: "POST route"
    flow:
      - post:
          url: "/api/product/prices"
          json:
            productId: "{{productId}}"
            seller: "{{seller}}"
            price: "{{price}}"
            tax: "{{tax}}"